[Killed] String mutation
GameObjects/Implementations/Board.cs:19:36
 
         public override string ToString()
         {
-            StringBuilder sb = new("");
+            StringBuilder sb = new("Stryker was here!");
             foreach (BoardTileDto[] tileRow in Tiles)
             {

[Killed] String mutation
GameObjects/Implementations/Board.cs:25:37
                 if (sb.Length > 0) sb.Append(Environment.NewLine);
                 foreach (BoardTileDto tile in tileRow)
                 {
-                    string letter = " ";
+                    string letter = "";
                     if (tile == null) letter = "~";
                     else if (tile.HasLetter()) letter = tile.Letter;

[Killed] String mutation
GameObjects/Implementations/Board.cs:26:48
                 foreach (BoardTileDto tile in tileRow)
                 {
                     string letter = " ";
-                    if (tile == null) letter = "~";
+                    if (tile == null) letter = "";
                     else if (tile.HasLetter()) letter = tile.Letter;
                     sb.Append($"[{letter}]");

[Killed] Negate expression
GameObjects/Implementations/Board.cs:27:30
                 {
                     string letter = " ";
                     if (tile == null) letter = "~";
-                    else if (tile.HasLetter()) letter = tile.Letter;
+                    else if (!(tile.HasLetter())) letter = tile.Letter;
                     sb.Append($"[{letter}]");
                 }

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:118:39
         {
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
-            if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
+            if (actualRowIndex < 0 || actualRowIndex > Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];

[Killed] Negate expression
GameObjects/Implementations/Board.cs:118:17
         {
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
-            if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
+            if (!(actualRowIndex < 0 || actualRowIndex >= Tiles.Length)) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:119:17
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
-            if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
+            if (actualColumnIndex > 0  || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];
             return tile ?? (returnNullInsteadOfException ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:119:42
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
-            if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
+            if (actualColumnIndex < 0 || actualColumnIndex > Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];
             return tile ?? (returnNullInsteadOfException ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));
