[Killed] Equality mutation
DataObjects/BoardTileDto.cs:22:17
 
         public BoardTileDto(int id, int boardId, int row, int column, bool isStart, string letter, int score)
         {
-            if (id < 1) throw new Exception(ID_BELOW_ONE);
+            if (id <= 1) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);

[Killed] Negate expression
DataObjects/BoardTileDto.cs:22:17
 
         public BoardTileDto(int id, int boardId, int row, int column, bool isStart, string letter, int score)
         {
-            if (id < 1) throw new Exception(ID_BELOW_ONE);
+            if (!(id < 1)) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);

[Killed] Equality mutation
DataObjects/BoardTileDto.cs:23:17
         public BoardTileDto(int id, int boardId, int row, int column, bool isStart, string letter, int score)
         {
             if (id < 1) throw new Exception(ID_BELOW_ONE);
-            if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
+            if (boardId > 1) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);
             if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);

[Killed] Negate expression
DataObjects/BoardTileDto.cs:23:17
         public BoardTileDto(int id, int boardId, int row, int column, bool isStart, string letter, int score)
         {
             if (id < 1) throw new Exception(ID_BELOW_ONE);
-            if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
+            if (!(boardId < 1)) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);
             if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);

[Killed] Negate expression
DataObjects/BoardTileDto.cs:24:17
         {
             if (id < 1) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
-            if (row < 1) throw new Exception(ROW_BELOW_ZERO);
+            if (!(row < 1)) throw new Exception(ROW_BELOW_ZERO);
             if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);
             Validators.ValidateLetter(letter);

[Killed] Equality mutation
DataObjects/BoardTileDto.cs:24:17
         {
             if (id < 1) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
-            if (row < 1) throw new Exception(ROW_BELOW_ZERO);
+            if (row <= 1) throw new Exception(ROW_BELOW_ZERO);
             if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);
             Validators.ValidateLetter(letter);

[Killed] Negate expression
DataObjects/BoardTileDto.cs:25:17
             if (id < 1) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);
-            if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);
+            if (!(column < 1)) throw new Exception(COLUMN_BELOW_ZERO);
             Validators.ValidateLetter(letter);
             Validators.ValidateScore(score);

[Killed] Equality mutation
DataObjects/BoardTileDto.cs:25:17
             if (id < 1) throw new Exception(ID_BELOW_ONE);
             if (boardId < 1) throw new Exception(BOARD_ID_BELOW_ONE);
             if (row < 1) throw new Exception(ROW_BELOW_ZERO);
-            if (column < 1) throw new Exception(COLUMN_BELOW_ZERO);
+            if (column > 1) throw new Exception(COLUMN_BELOW_ZERO);
             Validators.ValidateLetter(letter);
             Validators.ValidateScore(score);

[Killed] String mutation
DataObjects/BoardTileDto.cs:40:20
 
         public override string ToString()
         {
-            return $"Id = {Id}, BoardId = {BoardId}, Row = {Row}, Column = {Column}, IsStart = {IsStart}, Letter = {Letter}, Score = {Score}";
+            return $"";
         }
 

[Killed] String mutation
DataObjects/BoardTileDto.cs:45:34
 
         public bool DoesNotHaveLetter()
         {
-            return Letter.Equals("");
+            return Letter.Equals("Stryker was here!");
         }
         

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
DataObjects/BoardTileDto.cs:50:20
         
         public bool HasLetter()
         {
-            return !DoesNotHaveLetter();
+            return DoesNotHaveLetter();
         }
     }
