[Killed] Equality mutation
GameObjects/Implementations/Board.cs:25:21
             StringBuilder sb = new("");
             foreach (BoardTileDto[] tileRow in Tiles)
             {
-                if (sb.Length > 0) sb.Append(Environment.NewLine);
+                if (sb.Length < 0) sb.Append(Environment.NewLine);
                 foreach (BoardTileDto tile in tileRow)
                 {

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:25:21
             StringBuilder sb = new("");
             foreach (BoardTileDto[] tileRow in Tiles)
             {
-                if (sb.Length > 0) sb.Append(Environment.NewLine);
+                if (sb.Length >= 0) sb.Append(Environment.NewLine);
                 foreach (BoardTileDto tile in tileRow)
                 {

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:29:25
                 foreach (BoardTileDto tile in tileRow)
                 {
                     string letter = " ";
-                    if (tile == null) letter = "~";
+                    if (tile != null) letter = "~";
                     else if (!tile.DoesNotHaveLetter()) letter = tile.Letter;
                     sb.Append($"[{letter}]");

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GameObjects/Implementations/Board.cs:30:30
                 {
                     string letter = " ";
                     if (tile == null) letter = "~";
-                    else if (!tile.DoesNotHaveLetter()) letter = tile.Letter;
+                    else if (tile.DoesNotHaveLetter()) letter = tile.Letter;
                     sb.Append($"[{letter}]");
                 }

[Killed] String mutation
GameObjects/Implementations/Board.cs:31:31
                     string letter = " ";
                     if (tile == null) letter = "~";
                     else if (!tile.DoesNotHaveLetter()) letter = tile.Letter;
-                    sb.Append($"[{letter}]");
+                    sb.Append($"");
                 }
             }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GameObjects/Implementations/Board.cs:42:17
             BoardTileDto tile = GetTile(row, column);
             Validators.ValidateLetter(letter);
             Validators.ValidateScore(score);
-            if (!LetterRepository.LetterIsValid(letter)) throw new Exception(LETTER_IS_NOT_VALID);
+            if (LetterRepository.LetterIsValid(letter)) throw new Exception(LETTER_IS_NOT_VALID);
             tile.Letter = letter;
             tile.Score = score;

[Killed] Negate expression
GameObjects/Implementations/Board.cs:52:17
             Direction direction = Direction.Horizontal;
             List<BoardTileDto> tiles = new();
             BoardTileDto tile = GetTile(row, column);
-            if (tile.DoesNotHaveLetter()) return new BoardWord(direction, tiles);
+            if (!(tile.DoesNotHaveLetter())) return new BoardWord(direction, tiles);
 
             tiles.Add(tile);

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:56:30
 
             tiles.Add(tile);
 
-            int columnTemp = column - 1;
+            int columnTemp = column + 1;
             while (TileIsInPlayAndHasLetter(row, columnTemp))
             {

[Killed] Negate expression
GameObjects/Implementations/Board.cs:57:20
             tiles.Add(tile);
 
             int columnTemp = column - 1;
-            while (TileIsInPlayAndHasLetter(row, columnTemp))
+            while (!(TileIsInPlayAndHasLetter(row, columnTemp)))
             {
                 tiles.Insert(0, GetTile(row, columnTemp));

[Killed] PostDecrementExpression to PostIncrementExpression mutation
GameObjects/Implementations/Board.cs:60:17
             while (TileIsInPlayAndHasLetter(row, columnTemp))
             {
                 tiles.Insert(0, GetTile(row, columnTemp));
-                columnTemp--;
+                                columnTemp++;
             }
 

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:63:26
                 columnTemp--;
             }
 
-            columnTemp = column + 1;
+            columnTemp = column - 1;
             while (TileIsInPlayAndHasLetter(row, columnTemp))
             {

[Killed] Negate expression
GameObjects/Implementations/Board.cs:64:20
             }
 
             columnTemp = column + 1;
-            while (TileIsInPlayAndHasLetter(row, columnTemp))
+            while (!(TileIsInPlayAndHasLetter(row, columnTemp)))
             {
                 tiles.Add(GetTile(row, columnTemp));

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GameObjects/Implementations/Board.cs:67:17
             while (TileIsInPlayAndHasLetter(row, columnTemp))
             {
                 tiles.Add(GetTile(row, columnTemp));
-                columnTemp++;
+                                columnTemp--;
             }
             return new BoardWord(direction, tiles);

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:81:27
 
             tiles.Add(tile);
 
-            int rowTemp = row - 1;
+            int rowTemp = row + 1;
             while (TileIsInPlayAndHasLetter(rowTemp, column))
             {

[Killed] Negate expression
GameObjects/Implementations/Board.cs:82:20
             tiles.Add(tile);
 
             int rowTemp = row - 1;
-            while (TileIsInPlayAndHasLetter(rowTemp, column))
+            while (!(TileIsInPlayAndHasLetter(rowTemp, column)))
             {
                 tiles.Insert(0, GetTile(rowTemp, column));

[Killed] PostDecrementExpression to PostIncrementExpression mutation
GameObjects/Implementations/Board.cs:85:17
             while (TileIsInPlayAndHasLetter(rowTemp, column))
             {
                 tiles.Insert(0, GetTile(rowTemp, column));
-                rowTemp--;
+                                rowTemp++;
             }
 

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:88:23
                 rowTemp--;
             }
 
-            rowTemp = row + 1;
+            rowTemp = row - 1;
             while (TileIsInPlayAndHasLetter(rowTemp, column))
             {

[Killed] Negate expression
GameObjects/Implementations/Board.cs:89:20
             }
 
             rowTemp = row + 1;
-            while (TileIsInPlayAndHasLetter(rowTemp, column))
+            while (!(TileIsInPlayAndHasLetter(rowTemp, column)))
             {
                 tiles.Add(GetTile(rowTemp, column));

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GameObjects/Implementations/Board.cs:92:17
             while (TileIsInPlayAndHasLetter(rowTemp, column))
             {
                 tiles.Add(GetTile(rowTemp, column));
-                rowTemp++;
+                                rowTemp--;
             }
             return new BoardWord(direction, tiles);

[Killed] Boolean mutation
GameObjects/Implementations/Board.cs:99:84
 
         private bool TileIsInPlayAndHasLetter(int row, int column)
         {
-            BoardTileDto tile = GetTile(row, column, returnNullInsteadOfException: true);
+            BoardTileDto tile = GetTile(row, column, returnNullInsteadOfException: false);
             return tile != null && tile.HasLetter();
         }

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:100:20
         private bool TileIsInPlayAndHasLetter(int row, int column)
         {
             BoardTileDto tile = GetTile(row, column, returnNullInsteadOfException: true);
-            return tile != null && tile.HasLetter();
+            return tile == null  && tile.HasLetter();
         }
 

[Killed] Logical mutation
GameObjects/Implementations/Board.cs:100:20
         private bool TileIsInPlayAndHasLetter(int row, int column)
         {
             BoardTileDto tile = GetTile(row, column, returnNullInsteadOfException: true);
-            return tile != null && tile.HasLetter();
+            return tile != null || tile.HasLetter();
         }
 

[Killed] Negate expression
GameObjects/Implementations/Board.cs:110:25
             {
                 foreach (BoardTileDto tile in rowOfTiles)
                 {
-                    if (tile == null || tile.HasLetter()) continue;
+                    if (!(tile == null || tile.HasLetter())) continue;
                     if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:110:25
             {
                 foreach (BoardTileDto tile in rowOfTiles)
                 {
-                    if (tile == null || tile.HasLetter()) continue;
+                    if (tile != null  || tile.HasLetter()) continue;
                     if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:111:50
                 foreach (BoardTileDto tile in rowOfTiles)
                 {
                     if (tile == null || tile.HasLetter()) continue;
-                    if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
+                    if (TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) ||

[Killed] Logical mutation
GameObjects/Implementations/Board.cs:111:25
                 foreach (BoardTileDto tile in rowOfTiles)
                 {
                     if (tile == null || tile.HasLetter()) continue;
-                    if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
-                        TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
-                        TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) ||
-                        TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1)) anchors.Add(tile);
+                    if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
+                        TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
+                        TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) &&
+                        TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1)) anchors.Add(tile);
                 }
             }

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:112:50
                 {
                     if (tile == null || tile.HasLetter()) continue;
                     if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
-                        TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
+                        TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) ||
                         TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1)) anchors.Add(tile);

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:113:60
                     if (tile == null || tile.HasLetter()) continue;
                     if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
-                        TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) ||
+                        TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1) ||
                         TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1)) anchors.Add(tile);
                 }

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:114:60
                     if (TileIsInPlayAndHasLetter(tile.Row + 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row - 1, tile.Column) ||
                         TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1) ||
-                        TileIsInPlayAndHasLetter(tile.Row, tile.Column - 1)) anchors.Add(tile);
+                        TileIsInPlayAndHasLetter(tile.Row, tile.Column + 1)) anchors.Add(tile);
                 }
             }

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:122:34
 
         public BoardTileDto GetTile(int row, int column, bool returnNullInsteadOfException = false)
         {
-            int actualRowIndex = row - 1;
+            int actualRowIndex = row + 1;
             int actualColumnIndex = column - 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");

[Killed] Arithmetic mutation
GameObjects/Implementations/Board.cs:123:37
         public BoardTileDto GetTile(int row, int column, bool returnNullInsteadOfException = false)
         {
             int actualRowIndex = row - 1;
-            int actualColumnIndex = column - 1;
+            int actualColumnIndex = column + 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:124:17
         {
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
-            if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
+            if (actualRowIndex > 0  || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];

[Killed] Negate expression
GameObjects/Implementations/Board.cs:124:78
         {
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
-            if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
+            if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return !(returnNullInsteadOfException ) ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];

[Killed] Negate expression
GameObjects/Implementations/Board.cs:125:17
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
-            if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
+            if (!(actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length)) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];
             return tile ?? (returnNullInsteadOfException ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));

[Killed] Equality mutation
GameObjects/Implementations/Board.cs:125:42
             int actualRowIndex = row - 1;
             int actualColumnIndex = column - 1;
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
-            if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
+            if (actualColumnIndex < 0 || actualColumnIndex < Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];
             return tile ?? (returnNullInsteadOfException ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));

[Killed] Negate expression
GameObjects/Implementations/Board.cs:127:29
             if (actualRowIndex < 0 || actualRowIndex >= Tiles.Length) return returnNullInsteadOfException ? null : throw new Exception($"Row {row} is not valid.");
             if (actualColumnIndex < 0 || actualColumnIndex >= Tiles[0].Length) return returnNullInsteadOfException ? null : throw new Exception($"Column {column} is not valid.");
             BoardTileDto tile = Tiles[actualRowIndex][actualColumnIndex];
-            return tile ?? (returnNullInsteadOfException ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));
+            return tile ?? (!(returnNullInsteadOfException ) ? null : throw new Exception($"Tile at row {row}, column {column} is not in play."));
         }
     }
