[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:29:21
 
             foreach (BoardTileDto tile in tiles)
             {
-                if (tile == null) throw new Exception(TILE_IS_NULL);
+                if (tile != null) throw new Exception(TILE_IS_NULL);
                 if (tile.IsStart) countOfStartTiles++;
                 highestRow = Math.Max(highestRow, tile.Row);

[Killed] Negate expression
GameObjects/Implementations/BoardTileArrayCreator.cs:30:21
             foreach (BoardTileDto tile in tiles)
             {
                 if (tile == null) throw new Exception(TILE_IS_NULL);
-                if (tile.IsStart) countOfStartTiles++;
+                if (!(tile.IsStart)) countOfStartTiles++;
                 highestRow = Math.Max(highestRow, tile.Row);
                 highestColumn = Math.Max(highestColumn, tile.Column);

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:30:35
             foreach (BoardTileDto tile in tiles)
             {
                 if (tile == null) throw new Exception(TILE_IS_NULL);
-                if (tile.IsStart) countOfStartTiles++;
+                if (tile.IsStart) countOfStartTiles--;
                 highestRow = Math.Max(highestRow, tile.Row);
                 highestColumn = Math.Max(highestColumn, tile.Column);

[Killed] Linq method mutation (Max() to Min())
GameObjects/Implementations/BoardTileArrayCreator.cs:31:30
             {
                 if (tile == null) throw new Exception(TILE_IS_NULL);
                 if (tile.IsStart) countOfStartTiles++;
-                highestRow = Math.Max(highestRow, tile.Row);
+                highestRow = Math.Min(highestRow, tile.Row);
                 highestColumn = Math.Max(highestColumn, tile.Column);
             }

[Killed] Linq method mutation (Max() to Min())
GameObjects/Implementations/BoardTileArrayCreator.cs:32:33
                 if (tile == null) throw new Exception(TILE_IS_NULL);
                 if (tile.IsStart) countOfStartTiles++;
                 highestRow = Math.Max(highestRow, tile.Row);
-                highestColumn = Math.Max(highestColumn, tile.Column);
+                highestColumn = Math.Min(highestColumn, tile.Column);
             }
 

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:35:17
                 highestColumn = Math.Max(highestColumn, tile.Column);
             }
 
-            if (countOfStartTiles != 1) throw new Exception(COUNT_OF_START_TILES_MUST_BE_EXACTLY_1);
+            if (countOfStartTiles == 1) throw new Exception(COUNT_OF_START_TILES_MUST_BE_EXACTLY_1);
             BoardTileDto[][] organisedTiles = new BoardTileDto[highestRow][];
             for (int i = 0; i < organisedTiles.Length; i++) organisedTiles[i] = new BoardTileDto[highestColumn];

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:37:29
 
             if (countOfStartTiles != 1) throw new Exception(COUNT_OF_START_TILES_MUST_BE_EXACTLY_1);
             BoardTileDto[][] organisedTiles = new BoardTileDto[highestRow][];
-            for (int i = 0; i < organisedTiles.Length; i++) organisedTiles[i] = new BoardTileDto[highestColumn];
+            for (int i = 0; i <= organisedTiles.Length; i++) organisedTiles[i] = new BoardTileDto[highestColumn];
             return organisedTiles;
         }

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:37:29
 
             if (countOfStartTiles != 1) throw new Exception(COUNT_OF_START_TILES_MUST_BE_EXACTLY_1);
             BoardTileDto[][] organisedTiles = new BoardTileDto[highestRow][];
-            for (int i = 0; i < organisedTiles.Length; i++) organisedTiles[i] = new BoardTileDto[highestColumn];
+            for (int i = 0; i > organisedTiles.Length; i++) organisedTiles[i] = new BoardTileDto[highestColumn];
             return organisedTiles;
         }

[Killed] Arithmetic mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:45:31
         {
             foreach (BoardTileDto tile in tiles)
             {
-                if (tileArray[tile.Row - 1][tile.Column - 1] != null) throw new Exception($"Tile {tile} is already initialized.");
+                if (tileArray[tile.Row + 1][tile.Column - 1] != null) throw new Exception($"Tile {tile} is already initialized.");
                 tileArray[tile.Row - 1][tile.Column - 1] = tile;
             }

[Killed] Arithmetic mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:45:45
         {
             foreach (BoardTileDto tile in tiles)
             {
-                if (tileArray[tile.Row - 1][tile.Column - 1] != null) throw new Exception($"Tile {tile} is already initialized.");
+                if (tileArray[tile.Row - 1][tile.Column + 1] != null) throw new Exception($"Tile {tile} is already initialized.");
                 tileArray[tile.Row - 1][tile.Column - 1] = tile;
             }

[Killed] Arithmetic mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:46:27
             foreach (BoardTileDto tile in tiles)
             {
                 if (tileArray[tile.Row - 1][tile.Column - 1] != null) throw new Exception($"Tile {tile} is already initialized.");
-                tileArray[tile.Row - 1][tile.Column - 1] = tile;
+                tileArray[tile.Row + 1][tile.Column - 1] = tile;
             }
         }

[Killed] Arithmetic mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:46:41
             foreach (BoardTileDto tile in tiles)
             {
                 if (tileArray[tile.Row - 1][tile.Column - 1] != null) throw new Exception($"Tile {tile} is already initialized.");
-                tileArray[tile.Row - 1][tile.Column - 1] = tile;
+                tileArray[tile.Row - 1][tile.Column + 1] = tile;
             }
         }

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:52:29
 
         private static void CheckIfTileArrayContainsUnconnectedTiles(BoardTileDto[][] tileArray)
         {
-            for (int i = 0; i < tileArray.Length; i++)
+            for (int i = 0; i > tileArray.Length; i++)
             {
                 for (int j = 0; j < tileArray[i].Length; j++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:52:51
 
         private static void CheckIfTileArrayContainsUnconnectedTiles(BoardTileDto[][] tileArray)
         {
-            for (int i = 0; i < tileArray.Length; i++)
+            for (int i = 0; i < tileArray.Length; i--)
             {
                 for (int j = 0; j < tileArray[i].Length; j++)

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:54:33
         {
             for (int i = 0; i < tileArray.Length; i++)
             {
-                for (int j = 0; j < tileArray[i].Length; j++)
+                for (int j = 0; j <= tileArray[i].Length; j++)
                 {
                     BoardTileDto tile = tileArray[i][j];

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:54:33
         {
             for (int i = 0; i < tileArray.Length; i++)
             {
-                for (int j = 0; j < tileArray[i].Length; j++)
+                for (int j = 0; j > tileArray[i].Length; j++)
                 {
                     BoardTileDto tile = tileArray[i][j];

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:57:25
                 for (int j = 0; j < tileArray[i].Length; j++)
                 {
                     BoardTileDto tile = tileArray[i][j];
-                    if (tile == null) continue;
+                    if (tile != null) continue;
                     bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
                     bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:58:105
                 {
                     BoardTileDto tile = tileArray[i][j];
                     if (tile == null) continue;
-                    bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
+                    bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j > tileArray[i].Length - 1  && tileArray[i][j + 1] != null);
                     bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
                     if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:58:105
                 {
                     BoardTileDto tile = tileArray[i][j];
                     if (tile == null) continue;
-                    bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
+                    bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j <= tileArray[i].Length - 1  && tileArray[i][j + 1] != null);
                     bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
                     if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:59:61
                     BoardTileDto tile = tileArray[i][j];
                     if (tile == null) continue;
                     bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
-                    bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
+                    bool tileIsVerticallyConnectedToTile = (i >= 0  && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
                     if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
                 }

[Killed] Equality mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:59:103
                     BoardTileDto tile = tileArray[i][j];
                     if (tile == null) continue;
                     bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
-                    bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
+                    bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i <= tileArray.Length - 1  && tileArray[i + 1][j] != null);
                     if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
                 }

[Killed] Logical mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:60:25
                     if (tile == null) continue;
                     bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
                     bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
-                    if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
+                    if (!tileIsHorizontallyConnectedToTile || !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
                 }
             }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GameObjects/Implementations/BoardTileArrayCreator.cs:60:63
                     if (tile == null) continue;
                     bool tileIsHorizontallyConnectedToTile = (j > 0 && tileArray[i][j - 1] != null) || (j < tileArray[i].Length - 1 && tileArray[i][j + 1] != null);
                     bool tileIsVerticallyConnectedToTile = (i > 0 && tileArray[i - 1][j] != null) || (i < tileArray.Length - 1 && tileArray[i + 1][j] != null);
-                    if (!tileIsHorizontallyConnectedToTile && !tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
+                    if (!tileIsHorizontallyConnectedToTile && tileIsVerticallyConnectedToTile) throw new Exception($"Tile {tile} is not horizontally or vertically connected to another tile.");
                 }
             }
