[Killed] String mutation
GameObjects/Implementations/BoardWord.cs:30:41
             Func<BoardTileDto, int> constantCoordinate = (t) => t.Row;
             Func<BoardTileDto, int> incrementalCoordinate = (t) => t.Column;
             string constantKeyword = "Rows";
-            string incrementalKeyword = "Columns";
+            string incrementalKeyword = "";
             if (Direction == Direction.Vertical)
             {

[Killed] Equality mutation
GameObjects/Implementations/BoardWord.cs:31:17
             Func<BoardTileDto, int> incrementalCoordinate = (t) => t.Column;
             string constantKeyword = "Rows";
             string incrementalKeyword = "Columns";
-            if (Direction == Direction.Vertical)
+            if (Direction != Direction.Vertical)
             {
                 constantCoordinate = (t) => t.Column;

[Killed] String mutation
GameObjects/Implementations/BoardWord.cs:35:35
             {
                 constantCoordinate = (t) => t.Column;
                 incrementalCoordinate = (t) => t.Row;
-                constantKeyword = "Columns";
+                constantKeyword = "";
                 incrementalKeyword = "Rows";
             }

[Killed] Equality mutation
GameObjects/Implementations/BoardWord.cs:45:21
             {
                 int lastConstantCoordinateTemp = lastConstantCoordinate;
                 lastConstantCoordinate = constantCoordinate.Invoke(tile);
-                if (lastConstantCoordinateTemp != 0 && lastConstantCoordinate != lastConstantCoordinateTemp)
+                if (lastConstantCoordinateTemp == 0  && lastConstantCoordinate != lastConstantCoordinateTemp)
                 {
                     throw new Exception($"{constantKeyword} in board word are not constant.");

[Killed] Equality mutation
GameObjects/Implementations/BoardWord.cs:45:56
             {
                 int lastConstantCoordinateTemp = lastConstantCoordinate;
                 lastConstantCoordinate = constantCoordinate.Invoke(tile);
-                if (lastConstantCoordinateTemp != 0 && lastConstantCoordinate != lastConstantCoordinateTemp)
+                if (lastConstantCoordinateTemp != 0 && lastConstantCoordinate == lastConstantCoordinateTemp)
                 {
                     throw new Exception($"{constantKeyword} in board word are not constant.");

[Killed] Equality mutation
GameObjects/Implementations/BoardWord.cs:52:21
                 
                 int lastIncrementalCoordinateTemp = lastIncrementalCoordinate;
                 lastIncrementalCoordinate = incrementalCoordinate.Invoke(tile);
-                if (lastIncrementalCoordinateTemp == 0) continue;
+                if (lastIncrementalCoordinateTemp != 0) continue;
                 if (lastIncrementalCoordinate != lastIncrementalCoordinateTemp + 1)
                 {

[Killed] Arithmetic mutation
GameObjects/Implementations/BoardWord.cs:53:50
                 int lastIncrementalCoordinateTemp = lastIncrementalCoordinate;
                 lastIncrementalCoordinate = incrementalCoordinate.Invoke(tile);
                 if (lastIncrementalCoordinateTemp == 0) continue;
-                if (lastIncrementalCoordinate != lastIncrementalCoordinateTemp + 1)
+                if (lastIncrementalCoordinate != lastIncrementalCoordinateTemp - 1)
                 {
                     throw new Exception($"{incrementalKeyword} in board word are not incremental.");

[Killed] Equality mutation
GameObjects/Implementations/BoardWord.cs:53:21
                 int lastIncrementalCoordinateTemp = lastIncrementalCoordinate;
                 lastIncrementalCoordinate = incrementalCoordinate.Invoke(tile);
                 if (lastIncrementalCoordinateTemp == 0) continue;
-                if (lastIncrementalCoordinate != lastIncrementalCoordinateTemp + 1)
+                if (lastIncrementalCoordinate == lastIncrementalCoordinateTemp + 1)
                 {
                     throw new Exception($"{incrementalKeyword} in board word are not incremental.");

[Killed] String mutation
GameObjects/Implementations/BoardWord.cs:55:41
                 if (lastIncrementalCoordinateTemp == 0) continue;
                 if (lastIncrementalCoordinate != lastIncrementalCoordinateTemp + 1)
                 {
-                    throw new Exception($"{incrementalKeyword} in board word are not incremental.");
+                    throw new Exception($"");
                 }
             }
