[Killed] Equality mutation
Validators.cs:12:17
         public const string SCORE_BELOW_ZERO = "Score is below 0.";
         public static void ValidateLetter(string letter)
         {
-            if (letter == null) throw new Exception(LETTER_IS_NULL);
+            if (letter != null) throw new Exception(LETTER_IS_NULL);
             if (letter.Length > 1) throw new Exception(LETTER_MORE_THAN_ONE_CHARACTERS);
         }

[Killed] Equality mutation
Validators.cs:13:17
         public static void ValidateLetter(string letter)
         {
             if (letter == null) throw new Exception(LETTER_IS_NULL);
-            if (letter.Length > 1) throw new Exception(LETTER_MORE_THAN_ONE_CHARACTERS);
+            if (letter.Length < 1) throw new Exception(LETTER_MORE_THAN_ONE_CHARACTERS);
         }
         

[Killed] Equality mutation
Validators.cs:13:17
         public static void ValidateLetter(string letter)
         {
             if (letter == null) throw new Exception(LETTER_IS_NULL);
-            if (letter.Length > 1) throw new Exception(LETTER_MORE_THAN_ONE_CHARACTERS);
+            if (letter.Length >= 1) throw new Exception(LETTER_MORE_THAN_ONE_CHARACTERS);
         }
         

[Killed] Negate expression
Validators.cs:18:17
         
         public static void ValidateScore(int score)
         {
-            if (score < 0) throw new Exception(SCORE_BELOW_ZERO);
+            if (!(score < 0)) throw new Exception(SCORE_BELOW_ZERO);
         }
     }

[Killed] Equality mutation
Validators.cs:18:17
         
         public static void ValidateScore(int score)
         {
-            if (score < 0) throw new Exception(SCORE_BELOW_ZERO);
+            if (score > 0) throw new Exception(SCORE_BELOW_ZERO);
         }
     }
